film_id_name={6981153:'爱尔兰人',
              27010768:'寄生虫',
              27119724:'小丑',
              27202818:'婚姻故事',
              26794435:'哪吒之魔童降世',
              6850547:'玩具总动员4',
              26100958:'复仇者联盟4：终局之战',
              30327842:'82年生的金智英',
              30198539:'痛苦和荣耀',
              30257175:'燃烧女子的肖像',
              26858510:'克劳斯：圣诞节的秘密',      
              26348103:'小妇人',
              30329902:'青春期猪头少年不做怀梦少女的梦',        
              }

comment_location={"河北":1,"山西":2,"辽宁":3,"吉林":4,"黑龙江":5,"江苏":6,"浙江":7,"安徽":8,"福建":9,"江西":10,"山东":11,"河南":12,"湖北":13,"湖南":14,"广东":15,"海南":16,"四川":17,"贵州":18,"云南":19,"陕西":20,"甘肃":21,"青海":22,"台湾":23
,"内蒙古":24,"广西":25,"西藏":26,"宁夏":27,"新疆":28,"北京":29,"天津":30,"上海":31,"重庆":32,"香港":33,"澳门":34,'海外':35}